RaigK/Mysensors_STM32U083/src/main.cpp
/*
 * The MySensors Arduino library handles the wireless radio link and protocol
 * between your home built sensors/actuators and HA controller of choice.
 * The sensors forms a self healing radio network with optional repeaters. Each
 * repeater and gateway builds a routing tables in EEPROM which keeps track of the
 * network topology allowing messages to be routed to nodes.
 *
 * Created by Henrik Ekblad <henrik.ekblad@mysensors.org>
 * Copyright (C) 2013-2025 Sensnology AB
 * Full contributor list: https://github.com/mysensors/MySensors/graphs/contributors
 *
 * Documentation: http://www.mysensors.org
 * Support Forum: http://forum.mysensors.org
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 *******************************
 *
 * DESCRIPTION
 * Temperature/Humidity sensor using HDC1080 with battery monitoring
 * for STM32U083RC
 *
 */

// ======================== Power Mode Configuration ========================
// Run modes: POWER_RUN_NORMAL (16 MHz HSI), POWER_RUN_MEDIUM (4 MHz MSI, serial-safe),
//            POWER_RUN_LOW_POWER (2 MHz MSI, requires MY_DISABLED_SERIAL)
// Sleep modes: POWER_SLEEP_SLEEP, POWER_SLEEP_LP_SLEEP, POWER_SLEEP_STOP0,
//              POWER_SLEEP_STOP1, POWER_SLEEP_STOP2, POWER_SLEEP_STANDBY
#define MY_STM32_RUN_MODE    POWER_RUN_MEDIUM      // 4 MHz MSI — serial-safe, ~4× less than 16 MHz
#define MY_STM32_SLEEP_MODE  POWER_SLEEP_STOP2     // STOP1
#include "stm32_power_config.h"

// Enable debug prints (comment out for lowest power)
//#define MY_DEBUG
#define MY_SPLASH_SCREEN_DISABLED
#define MY_DISABLED_SERIAL
#define MY_SMART_SLEEP_WAIT_DURATION_MS 0
#define MY_SLEEP_TRANSPORT_RECONNECT_TIMEOUT_MS 0
#define MY_SLEEP_HANDLER  // we provide our own sleepHandler() below

// Enable signal report functionalities
#define MY_SIGNAL_REPORT_ENABLED

// Enable and select radio type attached
#define MY_RADIO_RFM69
#define MY_RFM69_NEW_DRIVER
#define MY_IS_RFM69HW
#define MY_RFM69_FREQUENCY RFM69_868MHZ
#define MY_RFM69_TX_POWER_DBM (6)
#define MY_RFM69_ATC_TARGET_RSSI_DBM (-70)
#define MY_RFM69_CS_PIN PB6
#define MY_RFM69_IRQ_PIN PA10
#define MY_RFM69_IRQ_NUM PA10
// MY_NODE_ID not defined → auto-assign from gateway (stored in EEPROM by MySensors)
#define MY_RFM69_SPI_SPEED (1*1000000ul)

#include <MySensors.h>
#include <SPI.h>
#include <Wire.h>
#include "ClosedCube_HDC1080.h"
// I2C2 pins for HDC1080
#define I2C2_SDA_PIN PB11
#define I2C2_SCL_PIN PB10

// Default sleep interval between reports (milliseconds); overridden by gateway via EEPROM
#define SLEEP_TIME_DEFAULT_MS 60000UL  // 60 seconds

// Status LED on PB0 — on during active, 1 Hz blink during first-boot 60s wait, off in sleep
#define LED_PIN PB0

// Child IDs
#define CHILD_ID_TEMP     0
#define CHILD_ID_HUM      1
#define CHILD_ID_BATT     2
#define CHILD_ID_RSSI     3
#define CHILD_ID_TX_POWER 4
#define CHILD_ID_INTERVAL 5  // Gateway-adjustable sleep interval (seconds,  V_VAR1)
#define CHILD_ID_BATT_MIN 6  // Gateway-adjustable battery cutoff voltage (mV, V_VAR1)
#define CHILD_ID_BATT_MAX 7  // Gateway-adjustable battery full    voltage (mV, V_VAR1)

// MySensors user-state EEPROM positions for persistent config.
// loadState(pos) / saveState(pos, val) operate on single bytes; uint16_t values
// are stored as two consecutive bytes (little-endian).
// Note: MySensors also writes to EEPROM on first boot (auto node ID, parent ID,
// controller config). EEPROM only erases a flash page on GC (page full), not on
// every write, so multiple writes per boot are safe in practice.
#define EE_INTERVAL_LO  0   // sleep interval seconds, low  byte
#define EE_INTERVAL_HI  1   // sleep interval seconds, high byte
#define EE_BATT_MIN_LO  2   // battery cutoff mV, low  byte
#define EE_BATT_MIN_HI  3   // battery cutoff mV, high byte
#define EE_BATT_MAX_LO  4   // battery full   mV, low  byte
#define EE_BATT_MAX_HI  5   // battery full   mV, high byte

// Default Li-SOCl2 battery thresholds
#define BATT_MIN_DEFAULT_MV 3100  // 3.1 V cutoff (above 2.8 V LDO dropout)
#define BATT_MAX_DEFAULT_MV 3600  // 3.6 V fully charged

// Battery voltage ADC pin
#define BATTERY_ADC_PIN PA0  // ADC1_IN4, LQFP64 pin 14
// Voltage divider ratio: 2:1 (1000k/1000k), battery=3.2V → PA0=1.6V
#define VOLTAGE_DIVIDER_RATIO 2.0
// ADC resolution (12-bit)
#define ADC_MAX_VALUE 4095
// VDDA measured at runtime via VREFINT factory calibration (see readVDDA())

// HDC1080 sensor
ClosedCube_HDC1080 hdc1080;

// Runtime adjustable parameters (loaded from EEPROM at boot)
static uint32_t sleepTimeMs = SLEEP_TIME_DEFAULT_MS;
static uint16_t battMinMv   = BATT_MIN_DEFAULT_MV;
static uint16_t battMaxMv   = BATT_MAX_DEFAULT_MV;
static bool firstLoop = true;

// Last RFM69 OPMODE seen after the radio-sleep workaround in sleepHandler().
// 0x80 = SequencerOff | SLEEP (target).  Anything else (e.g. 0x84 = SequencerOff
// | STANDBY) means the workaround failed and the radio is leaking ~1.2 mA in
// sleep.  Printed on the next wake so we can see it without keeping serial on
// during sleep.  0xFF = uninitialised (no sleep cycle has run yet).
static volatile uint8_t lastRfm69SleepOpMode = 0xFF;
static volatile uint8_t lastRfm69SleepRetries = 0;

// Pending EEPROM saves from receive() — actual flash write deferred to loop() to avoid
// triggering a flash page erase while the RFM69 ISR could fire.  On the single-bank
// STM32U0 the CPU cannot fetch instructions from flash while a page erase is running;
// any interrupt vector fetch during that window stalls (and may hang) the CPU.
static struct { bool interval : 1; bool battMin : 1; bool battMax : 1; } pendingSave = {};


// EEPROM helpers — MySensors saveState/loadState work per-byte
static uint16_t eeLoad16(uint8_t posLo)
{
	return (uint16_t)loadState(posLo) | ((uint16_t)loadState(posLo + 1) << 8);
}
static void eeSave16(uint8_t posLo, uint16_t val)
{
	saveState(posLo,     (uint8_t)(val & 0xFF));
	saveState(posLo + 1, (uint8_t)(val >> 8));
}

// MySensors messages
MyMessage msgTemp(CHILD_ID_TEMP,     V_TEMP);
MyMessage msgHum(CHILD_ID_HUM,       V_HUM);
MyMessage msgBatt(CHILD_ID_BATT,     V_VOLTAGE);
MyMessage msgRSSI(CHILD_ID_RSSI,     V_LEVEL);
MyMessage msgTxPower(CHILD_ID_TX_POWER, V_LEVEL);
MyMessage msgInterval(CHILD_ID_INTERVAL, V_VAR1);
MyMessage msgBattMin(CHILD_ID_BATT_MIN,  V_VAR1);
MyMessage msgBattMax(CHILD_ID_BATT_MAX,  V_VAR1);

// Custom system clock configuration with power mode support
// Supports: Normal Run (16 MHz HSI), Medium Run (4 MHz MSI), Low Power Run (2 MHz MSI)
extern "C" void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {};

