RaigK/Mysensors_STM32U083/src/main.cpp
#if MY_STM32_RUN_MODE == POWER_RUN_LOW_POWER
	// ==================== Low Power Run Mode (2 MHz MSI) ====================
	// Exit Low Power Run mode first if we're in it (required before clock changes)
	if (READ_BIT(PWR->SR2, PWR_SR2_REGLPF)) {
		HAL_PWREx_DisableLowPowerRunMode();
	}

	// Voltage scaling range 2 (required for LPR, valid up to 16 MHz)
	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);

	// Enable MSI at 2 MHz (range 5) and LSI for RTC
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI | RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_5;  // 2 MHz
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	// Use MSI as system clock (2 MHz)
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		Error_Handler();
	}

	// Enter Low Power Run mode (must be ≤ 2 MHz)
	HAL_PWREx_EnableLowPowerRunMode();

#elif MY_STM32_RUN_MODE == POWER_RUN_MEDIUM
	// ==================== Medium Run Mode (4 MHz HCLK from 16 MHz HSI / 4) ====================
	// Keep HSI as the SYSCLK source (avoids MSI switch issues on STM32U0) and divide
	// the AHB bus by 4 → HCLK = PCLK1 = 4 MHz.  Serial-safe: 115200 baud BRR = 35,
	// error < 1 %.  SystemCoreClock (HCLK) reflects the actual CPU frequency.
	//
	// Use LPR control bit (not REGLPF status bit) to detect Low Power Run mode.
	// REGLPF is set after ANY Stop mode exit (LP regulator was active in Stop), so
	// checking it here would call DisableLowPowerRunMode() on every wake-up — and
	// that function waits with HAL_GetTick() which is frozen after Stop exit (SysTick
	// interrupt was suspended), causing an infinite loop. LPR is only set when we
	// explicitly entered Low Power Run mode (2 MHz), which MEDIUM mode never does.
	if (READ_BIT(PWR->CR1, PWR_CR1_LPR)) {
		HAL_PWREx_DisableLowPowerRunMode();
	}

	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);

	// Enable HSI (16 MHz) and LSI for RTC — same oscillators as NORMAL mode
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	// After Stop mode exit, STM32U0 defaults to MSI as system clock (STOPWUCK=0).
	// We are on HSI, so set STOPWUCK=1 to select HSI as the Stop wakeup clock.
	// This ensures that after any Stop exit, SYSCLK = HSI = 16 MHz immediately,
	// so HCLK = 4 MHz and SystemClock_Config() is effectively a no-op on wake-up.
	__HAL_RCC_WAKEUPSTOP_CLK_CONFIG(RCC_STOP_WAKEUPCLOCK_HSI);

	// SYSCLK = HSI 16 MHz, HCLK = SYSCLK / 4 = 4 MHz, PCLK1 = 4 MHz
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV4;   // 16 / 4 = 4 MHz HCLK
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		Error_Handler();
	}

#else
	// ==================== Normal Run Mode (16 MHz HSI) ====================
	// Check LPR control bit, not REGLPF status bit (see MEDIUM mode comment above).
	if (READ_BIT(PWR->CR1, PWR_CR1_LPR)) {
		HAL_PWREx_DisableLowPowerRunMode();
	}

	// Voltage scaling range 1 (1.2V) for 16 MHz with 0 wait states (valid up to 24 MHz)
	// VOS2 at 16MHz needs FLASH_LATENCY_1 which may have HAL issues on STM32U0
	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

	// Enable HSI (16 MHz) and LSI (for RTC)
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;  // No PLL for lower power
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	// Use HSI directly as system clock (16 MHz)
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	// VOS range 1: 0 WS up to 24 MHz
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		Error_Handler();
	}
#endif
}

// Custom HardFault handler — prints the stacked PC/LR so we can identify the crash site.
// Cortex-M0+ stacks {R0,R1,R2,R3,R12,LR,PC,xPSR} on the MSP before entering the handler.
// The naked wrapper passes SP (= address of that frame) to the C function without disturbing it.
extern "C" void hard_fault_impl(uint32_t *frame)
{
	uint32_t pc  = frame[6];
	uint32_t lr  = frame[5];
	uint32_t r0  = frame[0];
	uint32_t r12 = frame[4];
	Serial.println("\n\n=== HARD FAULT ===");
	Serial.print("PC : 0x"); Serial.println(pc,  HEX);
	Serial.print("LR : 0x"); Serial.println(lr,  HEX);
	Serial.print("R0 : 0x"); Serial.println(r0,  HEX);
	Serial.print("R12: 0x"); Serial.println(r12, HEX);
	Serial.flush();
	while (1) {}
}

extern "C" __attribute__((naked)) void HardFault_Handler(void)
{
	__asm volatile (
		"mov r0, sp                \n"
		"ldr r1, =hard_fault_impl  \n"
		"bx  r1                    \n"
	);
}

void before()
{
	// Enable DBGMCU clock first (STM32U0-specific: RCC->DBGCFGR.DBGEN must be set
	// before any DBGMCU register writes take effect)
	__HAL_RCC_DBGMCU_CLK_ENABLE();
	// Enable debug in STOP mode so SWD stays accessible in sleep
	HAL_DBGMCU_EnableDBGStopMode();

