RaigK/Mysensors_STM32U083/src/main.cpp
	// hwInit() already called Serial.begin() with LPUART1 (default).
	// Re-initialize Serial with USART2 via ALT1 pins:
	// PA_2_ALT1 = USART2 TX (AF7), PA_3_ALT1 = USART2 RX (AF7)
	Serial.end();  // deinit LPUART1 before switching to USART2
	Serial.setTx(PA_2_ALT1);
	Serial.setRx(PA_3_ALT1);
	Serial.begin(115200);
	delay(100);
	// Print reset cause before clearing flags — critical for diagnosing unexpected resets
	{
		uint32_t csr = RCC->CSR;
		Serial.print("RST=0x"); Serial.print(csr >> 24, HEX);
		if (csr & RCC_CSR_LPWRRSTF)  Serial.print(" LPWR");   // illegal stop/standby entry
		if (csr & RCC_CSR_WWDGRSTF)  Serial.print(" WWDG");
		if (csr & RCC_CSR_IWDGRSTF)  Serial.print(" IWDG");
		if (csr & RCC_CSR_SFTRSTF)   Serial.print(" SFT");    // NVIC_SystemReset()
		if (csr & RCC_CSR_PWRRSTF)   Serial.print(" PWR");    // POR/BOR
		if (csr & RCC_CSR_PINRSTF)   Serial.print(" PIN");    // NRST pin
		if (csr & RCC_CSR_OBLRSTF)   Serial.print(" OBL");
		Serial.println();
		RCC->CSR |= RCC_CSR_RMVF;  // clear all reset flags for next boot
	}

	Serial.println("=== BOOT === (5s upload window)");
	// No Serial.flush() here — it blocks forever if uart_init fails

	// 5-second startup delay: guaranteed window for SWD upload
	// Remove this delay once firmware is confirmed working
	delay(5000);
}

void setup()
{

#ifndef MY_DISABLED_SERIAL
	// Print actual clock speed and power mode info
	// SystemCoreClock = HCLK (CPU bus clock), updated by HAL_RCC_ClockConfig.
	// In MEDIUM mode SYSCLK = 16 MHz HSI but HCLK = 4 MHz (AHB /4), so use
	// SystemCoreClock here instead of HAL_RCC_GetSysClockFreq() (which returns SYSCLK).
	Serial.print("System clock: ");
	Serial.print(SystemCoreClock / 1000000);
	Serial.println(" MHz");
#if POWER_DEBUG_ENABLED
	Serial.print("Run mode: ");
	Serial.println(power_run_mode_name());
	Serial.print("Sleep mode: ");
	Serial.println(power_sleep_mode_name());
#endif
#endif

	// Initialize I2C2 (PB10=SCL, PB11=SDA) at reduced clock for reliability
	Wire.setSCL(I2C2_SCL_PIN);
	Wire.setSDA(I2C2_SDA_PIN);
	Wire.setClock(10000);  // 10 kHz
	Wire.begin();

	// Initialize HDC1080
	hdc1080.begin(0x40);

	// Status LED
	pinMode(LED_PIN, OUTPUT);
	digitalWrite(LED_PIN, LOW);

	// Configure battery ADC pin as analog input
	// Note: analogRead() is NOT used — STM32duino analog.cpp has a bug on STM32U0:
	// ADC_ChannelConfTypeDef.SamplingTime must be ADC_SAMPLINGTIME_COMMON_1/2 (index),
	// not a raw cycle count (only STM32G0xx is excluded; STM32U0xx should be too).
	// We use direct HAL calls in readADC_U0() instead.
	pinMode(BATTERY_ADC_PIN, INPUT_ANALOG);

	// Load persisted settings from EEPROM (MySensors user state).
	// Uninitialized bytes read as 0xFF; range checks detect first boot.
	{
		uint16_t v;
		v = eeLoad16(EE_INTERVAL_LO);
		if (v >= 10 && v <= 3600) sleepTimeMs = (uint32_t)v * 1000UL;

		v = eeLoad16(EE_BATT_MIN_LO);
		if (v >= 2000 && v <= 4200) battMinMv = v;

		v = eeLoad16(EE_BATT_MAX_LO);
		if (v >= 2000 && v <= 4200) battMaxMv = v;
	}

#ifndef MY_DISABLED_SERIAL
	Serial.print("EEPROM: interval="); Serial.print(sleepTimeMs / 1000);
	Serial.print("s  batt="); Serial.print(battMinMv);
	Serial.print("-"); Serial.print(battMaxMv); Serial.println(" mV");
#endif
}

void presentation()
{
	sendSketchInfo("TempHum Battery Node", "1.1");

	present(CHILD_ID_TEMP, S_TEMP);
	present(CHILD_ID_HUM, S_HUM);
	present(CHILD_ID_BATT, S_MULTIMETER);
	present(CHILD_ID_RSSI,     S_SOUND,   "RSSI dBm");
	present(CHILD_ID_TX_POWER, S_SOUND,   "TX Power dBm");
	present(CHILD_ID_INTERVAL, S_CUSTOM,  "Sleep interval s");
	present(CHILD_ID_BATT_MIN, S_CUSTOM,  "Batt cutoff mV");
	present(CHILD_ID_BATT_MAX, S_CUSTOM,  "Batt full mV");
}

// Called by MySensors when the gateway sends a C_SET message to this node.
// All three adjustable parameters use V_VAR1 payload (integer).
//
//   Sleep interval  : "11;5;1;0;24;<seconds>"  range 10–3600
//   Battery cutoff  : "11;6;1;0;24;<mV>"       range 2000–4200  (e.g. 2850 → 2.85 V)
//   Battery full    : "11;7;1;0;24;<mV>"        range 2000–4200  (e.g. 3600 → 3.60 V)
//
// Values are persisted to EEPROM and take effect immediately.
void receive(const MyMessage &message)
{
	if (message.getType() != V_VAR1) {
		return;
	}

	long raw = message.getLong();
	uint8_t sensor = message.getSensor();

	// Update RAM immediately; EEPROM write is deferred to flushPendingSaves() in
	// loop() to avoid a flash page erase while the RFM69 ISR could fire.
	if (sensor == CHILD_ID_INTERVAL) {
		if (raw < 10)   raw = 10;
		if (raw > 3600) raw = 3600;
		sleepTimeMs = (uint32_t)(uint16_t)raw * 1000UL;
		pendingSave.interval = true;
#ifndef MY_DISABLED_SERIAL
		Serial.print("Interval -> "); Serial.print((uint16_t)raw); Serial.println("s");
#endif

	} else if (sensor == CHILD_ID_BATT_MIN) {
		if (raw < 2000) raw = 2000;
		if (raw > 4200) raw = 4200;
		battMinMv = (uint16_t)raw;
		pendingSave.battMin = true;
#ifndef MY_DISABLED_SERIAL
		Serial.print("Batt cutoff -> "); Serial.print(battMinMv); Serial.println(" mV");
#endif

	} else if (sensor == CHILD_ID_BATT_MAX) {
		if (raw < 2000) raw = 2000;
		if (raw > 4200) raw = 4200;
		battMaxMv = (uint16_t)raw;
		pendingSave.battMax = true;
#ifndef MY_DISABLED_SERIAL
		Serial.print("Batt full   -> "); Serial.print(battMaxMv); Serial.println(" mV");
#endif
	}
}

// Write any parameter changes received via receive() to EEPROM.
// Called from loop() when the radio stack is idle (outside wait()/transport calls),
// so no interrupt can fire during the flash page erase.
static void flushPendingSaves()
{
	if (pendingSave.interval) {
		eeSave16(EE_INTERVAL_LO, (uint16_t)(sleepTimeMs / 1000));
		pendingSave.interval = false;
#ifndef MY_DISABLED_SERIAL
		Serial.print("EEPROM: interval="); Serial.print(sleepTimeMs / 1000); Serial.println("s");
#endif
	}
	if (pendingSave.battMin) {
		eeSave16(EE_BATT_MIN_LO, battMinMv);
		pendingSave.battMin = false;
#ifndef MY_DISABLED_SERIAL
		Serial.print("EEPROM: battMin="); Serial.print(battMinMv); Serial.println(" mV");
#endif
	}
	if (pendingSave.battMax) {
		eeSave16(EE_BATT_MAX_LO, battMaxMv);
		pendingSave.battMax = false;
#ifndef MY_DISABLED_SERIAL
		Serial.print("EEPROM: battMax="); Serial.print(battMaxMv); Serial.println(" mV");
#endif
	}
}

// Direct HAL ADC read for STM32U0, bypassing analogRead().
// Root cause of analogRead() returning 0: STM32duino analog.cpp line ~1125 checks
// only !defined(STM32G0xx) before setting AdcChannelConf.SamplingTime to the raw
// cycle count (e.g. ADC_SAMPLETIME_12CYCLES_5). On STM32U0 the field must be
// ADC_SAMPLINGTIME_COMMON_1 or ADC_SAMPLINGTIME_COMMON_2 (an index into the two
// shared sample-time registers), so HAL_ADC_ConfigChannel() fails and returns 0.
static uint32_t readADC_U0(uint32_t channel)
{
	ADC_HandleTypeDef hadc          = {};
	ADC_ChannelConfTypeDef sConfig  = {};

	__HAL_RCC_ADC_CLK_ENABLE();

	hadc.Instance                   = ADC1;
	hadc.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
	hadc.Init.Resolution            = ADC_RESOLUTION_12B;
	hadc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
	hadc.Init.ScanConvMode          = ADC_SCAN_SEQ_FIXED;
	hadc.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
	hadc.Init.LowPowerAutoWait      = DISABLE;
	hadc.Init.LowPowerAutoPowerOff  = DISABLE;
	hadc.Init.ContinuousConvMode    = DISABLE;
	hadc.Init.DiscontinuousConvMode = DISABLE;
	hadc.Init.ExternalTrigConv      = ADC_SOFTWARE_START;
	hadc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
	hadc.Init.DMAContinuousRequests = DISABLE;
	hadc.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
	hadc.Init.SamplingTimeCommon1   = ADC_SAMPLETIME_160CYCLES_5;  // shared timing slot 1
	hadc.Init.SamplingTimeCommon2   = ADC_SAMPLETIME_160CYCLES_5;  // shared timing slot 2
	hadc.Init.OversamplingMode      = DISABLE;

	HAL_StatusTypeDef r;
	r = HAL_ADC_Init(&hadc);
	if (r != HAL_OK) {
		__HAL_RCC_ADC_CLK_DISABLE();
		return 0;
	}

	// Note: HAL_ADCEx_Calibration_Start() consistently returns HAL_ERROR on STM32U0
	// regardless of ADEN state — skipped. Factory trim (CALFACT) is loaded from OTP
	// at power-on by the STM32U0 ROM; no runtime calibration needed for battery monitoring.

	sConfig.Channel      = channel;
	sConfig.Rank         = ADC_RANK_CHANNEL_NUMBER;
	sConfig.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;  // index, not raw cycles

	r = HAL_ADC_ConfigChannel(&hadc, &sConfig);
	if (r != HAL_OK) {
		HAL_ADC_DeInit(&hadc);
		__HAL_RCC_ADC_CLK_DISABLE();
		return 0;
	}

	r = HAL_ADC_Start(&hadc);

	uint32_t value = 0;
	if (r == HAL_OK) {
		r = HAL_ADC_PollForConversion(&hadc, 100);
		if (r == HAL_OK) {
			value = HAL_ADC_GetValue(&hadc);
		}
	}

