RaigK/Mysensors_STM32U083/src/main.cpp
	HAL_ADC_Stop(&hadc);
	HAL_ADC_DeInit(&hadc);
	__HAL_RCC_ADC_CLK_DISABLE();
	return value;
}

// Measure actual VDDA using VREFINT factory calibration.
// VDDA = VREFINT_CAL_VREF_mV * VREFINT_CAL_VALUE / ADC_reading_of_VREFINT
static float readVDDA()
{
	ADC1_COMMON->CCR |= ADC_CCR_VREFEN;    // enable internal VREFINT path
	HAL_Delay(1);                           // wait ≥12 µs for VREFINT startup
	uint32_t raw = readADC_U0(ADC_CHANNEL_VREFINT);
	ADC1_COMMON->CCR &= ~ADC_CCR_VREFEN;
	if (raw == 0) return 3.0f;             // fallback if ADC failed
	uint16_t cal = *VREFINT_CAL_ADDR;     // factory value measured at VREFINT_CAL_VREF mV
	// ES0602 errata 2.1.2: VREFINT_CAL not programmed on early devices (date codes 333-345,
	// first Nucleo/Discovery batch) — reads 0xFFFF instead of calibration value.
	// Fall back to 3.0 V assumption rather than computing ~115 V VDDA.
	if (cal == 0xFFFF || cal == 0) return 3.0f;
	return ((float)VREFINT_CAL_VREF * (float)cal) / ((float)raw * 1000.0f);
}

float readBatteryVoltage()
{
	// PA0 = ADC1_IN4 (channel 4) on STM32U083, LQFP64 pin 14
	float vdda = readVDDA();
	uint32_t raw = readADC_U0(ADC_CHANNEL_4);
	float voltage = ((float)raw / ADC_MAX_VALUE) * vdda * VOLTAGE_DIVIDER_RATIO;

#ifndef MY_DISABLED_SERIAL
	Serial.print("ADC raw: ");
	Serial.print(raw);
	Serial.print(" -> ");
	Serial.print(voltage, 3);
	Serial.println("V");
#endif

	return voltage;
}

uint8_t voltageToBatteryPercent(float voltage)
{
	float minV = battMinMv / 1000.0f;
	float maxV = battMaxMv / 1000.0f;
	if (voltage <= minV) return 0;
	if (voltage >= maxV) return 100;
	return (uint8_t)(((voltage - minV) / (maxV - minV)) * 100);
}

// Manual SPI register access for RFM69. Used by sleepHandler() to re-assert
// SLEEP mode after MySensors' RFM69_sleep() — see workaround comment there.
// Mode 0, MSB first; bit7 of address: 0=read, 1=write.
static uint8_t rfm69ReadReg(uint8_t addr)
{
	SPI.beginTransaction(SPISettings(MY_RFM69_SPI_SPEED, MSBFIRST, SPI_MODE0));
	digitalWrite(MY_RFM69_CS_PIN, LOW);
	SPI.transfer(addr & 0x7F);
	uint8_t val = SPI.transfer(0x00);
	digitalWrite(MY_RFM69_CS_PIN, HIGH);
	SPI.endTransaction();
	return val;
}

static void rfm69WriteReg(uint8_t addr, uint8_t val)
{
	SPI.beginTransaction(SPISettings(MY_RFM69_SPI_SPEED, MSBFIRST, SPI_MODE0));
	digitalWrite(MY_RFM69_CS_PIN, LOW);
	SPI.transfer(addr | 0x80);
	SPI.transfer(val);
	digitalWrite(MY_RFM69_CS_PIN, HIGH);
	SPI.endTransaction();
}

// MySensors sleep hook — runs after transportDisable() (radio already asleep)
// and before hwSleep() enters STOP. The mirror call happens on wake before
// transportReInitialise(). Mirrors the patched HAL's hwConfigureGpioLowPower /
// hwRestoreAfterSleep flow used in the Arduino env, adapted for cube env.
//
// Pins handled:
//   PA0          analog        — battery ADC (1M/1M divider on PA0 bleeds
//                                 ~1.65 µA at 3.3 V regardless of pin mode;
//                                 negligible relative to other sleep paths.)
//   PA2/PA3      analog        — USART2 TX/RX (releases internal pull-up on RX)
//   PA5/PA7      output LOW    — SPI1 SCK/MOSI (defined state, no float)
//   PA6          analog        — SPI1 MISO (driven by RFM69 in sleep, buffer off)
//   PA10         analog        — RFM69 IRQ; not used as wake source (we wake on
//                                 RTC alarm), so the input buffer can go off
//   PA13/PA14    analog        — SWD (kills internal pulls + SWD probe leakage,
//                                 ~350 µA savings; restored to AF on wake)
//   PA1/4/8/9/11/12/15  analog — unused
//   PB0          output LOW    — LED (already driven LOW by app code)
//   PB6          output HIGH   — RFM69 CS (held high during sleep)
//   PB10/PB11    analog        — I2C2 SCL/SDA (releases HDC1080 ext pull-ups)
//   PB others    analog        — unused
//   PC, PD       analog        — all unused
//
// DBG_STOP is disabled in STOP and re-enabled on wake so SWD live-debug still
// works between sleep cycles (DBG_STOP costs ~1 mA on STM32U0 if left on).
void sleepHandler(bool entering)
{
	if (entering) {
		HAL_DBGMCU_DisableDBGStopMode();

		// Workaround: MySensors' RFM69_sleep() leaves the chip in 0x84 (SequencerOff
		// + STANDBY) on this RFM69HW module — writing SLEEP doesn't stick on its
		// own. The empirically-verified pattern is: write SLEEP, then a follow-up
		// read of OPMODE (which auto-wakes the chip to STANDBY, then the rising CS
		// edge cleanly transitions STANDBY → SLEEP), then a few ms of stability
		// before SPI.end() reconfigures the SCK/MOSI pins.
		// Verified 2026-05-07: drops board sleep current from ~1.2 mA to ~28 µA.
		// Verify+retry: read OPMODE back; if not 0x80 (SLEEP), retry. STANDBY
		// (0x84) leaks ~1.2 mA, so failure is expensive — keep trying.
		uint8_t op = 0;
		uint8_t retries = 0;
		for (; retries < 5; ++retries) {
			rfm69WriteReg(0x01, 0x80);  // SequencerOff | LISTEN_OFF | SLEEP
			(void)rfm69ReadReg(0x01);   // kick: auto-wake to STANDBY, CS↑ → SLEEP
			delay(3);                   // let the transition settle
			op = rfm69ReadReg(0x01);    // verify (this read also auto-wakes; the
			                            // CS↑ at the end of the read drops it back
			                            // to SLEEP if the previous write took)
			if (op == 0x80) break;
		}
		lastRfm69SleepOpMode = op;
		lastRfm69SleepRetries = retries;

		Serial.flush();
		Serial.end();
		SPI.end();
		Wire.end();

		// Make sure the analog source switches inside ADC_CCR are off so they
		// don't bleed standby current (VREFINT bandgap, VBAT divider, temp
		// sensor). VREFEN is normally cleared in readVDDA(), TSEN/VBATEN are
		// never enabled by us — defensive belt-and-braces.
		ADC1_COMMON->CCR &= ~(ADC_CCR_VREFEN | ADC_CCR_TSEN | ADC_CCR_VBATEN);

		__HAL_RCC_GPIOA_CLK_ENABLE();
		__HAL_RCC_GPIOB_CLK_ENABLE();
		__HAL_RCC_GPIOC_CLK_ENABLE();
		__HAL_RCC_GPIOD_CLK_ENABLE();

		GPIO_InitTypeDef g = {};
		g.Pull  = GPIO_NOPULL;
		g.Speed = GPIO_SPEED_FREQ_LOW;

		// PA5/PA7 (SPI SCK/MOSI) → output LOW first, then mark them as drivers.
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5 | GPIO_PIN_7, GPIO_PIN_RESET);
		g.Mode = GPIO_MODE_OUTPUT_PP;
		g.Pin  = GPIO_PIN_5 | GPIO_PIN_7;
		HAL_GPIO_Init(GPIOA, &g);

