RaigK/Mysensors_STM32U083/src/main.cpp
		// All other PA pins → analog, *including* PA13/PA14 (SWD).  Keeping SWD
		// in AF during sleep leaves PA13's ~40 kΩ pull-up and PA14's pull-down
		// engaged, plus any ST-Link probe load — measured ~350 µA leakage with
		// probe attached.  Setting them to analog kills both internal pulls and
		// disconnects the SWD pads.  Flashing still works: STM32CubeProgrammer
		// uses Under-Reset mode (NRST held low) which forces SWD active
		// regardless of pin config.  PA13/PA14 are restored to AF on wake.
		// PA10 (RFM69 IRQ) is included: we never wake on it (the radio is
		// in OPMODE=SLEEP and won't fire DIO0 until reinitialised on wake),
		// so disabling its input buffer saves a small amount of static draw.
		g.Mode = GPIO_MODE_ANALOG;
		g.Pin  = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
		         GPIO_PIN_4 | GPIO_PIN_6 |
		         GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 |
		         GPIO_PIN_11 | GPIO_PIN_12 |
		         GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
		HAL_GPIO_Init(GPIOA, &g);

		// PB: PB0 stays output LOW (driven by app), PB6 stays output HIGH
		// (RFM69 CS, last state preserved). All others → analog.
		g.Pin  = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
		         GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7 | GPIO_PIN_8 |
		         GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 |
		         GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
		HAL_GPIO_Init(GPIOB, &g);

		// PC, PD entirely analog.
		g.Pin = GPIO_PIN_ALL;
		HAL_GPIO_Init(GPIOC, &g);
		HAL_GPIO_Init(GPIOD, &g);

		__HAL_RCC_GPIOC_CLK_DISABLE();
		__HAL_RCC_GPIOD_CLK_DISABLE();

		// Drop peripheral clocks the GPIO sweep already detached.
		__HAL_RCC_USART2_CLK_DISABLE();
		__HAL_RCC_SPI1_CLK_DISABLE();
		__HAL_RCC_I2C2_CLK_DISABLE();
		__HAL_RCC_ADC_CLK_DISABLE();
		__HAL_RCC_DBGMCU_CLK_DISABLE();
	} else {
		// Wake path: re-init in the order callers expect to use them.
		__HAL_RCC_DBGMCU_CLK_ENABLE();
		HAL_DBGMCU_EnableDBGStopMode();

		// Restore SWD pins (PA13=SWDIO, PA14=SWCLK) to alternate function
		// so an attached debug probe can re-attach between sleep cycles.
		__HAL_RCC_GPIOA_CLK_ENABLE();
		GPIO_InitTypeDef gs = {};
		gs.Mode      = GPIO_MODE_AF_PP;
		gs.Pull      = GPIO_PULLUP;        // SWDIO needs pull-up by default
		gs.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
		gs.Alternate = GPIO_AF0_SWD;
		gs.Pin       = GPIO_PIN_13;
		HAL_GPIO_Init(GPIOA, &gs);
		gs.Pull      = GPIO_PULLDOWN;      // SWCLK pull-down
		gs.Pin       = GPIO_PIN_14;
		HAL_GPIO_Init(GPIOA, &gs);

		Serial.begin(115200);
		SPI.begin();
		Wire.begin();
	}
}

void loop()
{
	digitalWrite(LED_PIN, HIGH);  // LED on during active state

	// Report the radio sleep state from the previous sleep cycle. 0x80 = SLEEP
	// (target, ~0.1 µA). 0x84 = STANDBY (~1.2 mA leak — workaround failed).
	// 0xFF = first boot, no sleep cycle has run yet.
	if (lastRfm69SleepOpMode != 0xFF) {
		Serial.print("Prev sleep RFM69 OPMODE=0x");
		Serial.print(lastRfm69SleepOpMode, HEX);
		Serial.print(" retries=");
		Serial.println(lastRfm69SleepRetries);
	}

	// Read HDC1080 sensor
	float temperature = hdc1080.readTemperature();
	float humidity = hdc1080.readHumidity();

	// Read battery voltage
	float batteryVoltage = readBatteryVoltage();
	uint8_t batteryPercent = voltageToBatteryPercent(batteryVoltage);

	// Print to serial
	Serial.print("Temp: ");
	Serial.print(temperature, 1);
	Serial.print("C, Hum: ");
	Serial.print(humidity, 1);
	Serial.print("%, Batt: ");
	Serial.print(batteryVoltage, 2);
	Serial.print("V (");
	Serial.print(batteryPercent);
	Serial.println("%)");

	// Battery empty - send 0% and stop transmitting to preserve remaining capacity.
	// Guard > 2.5V: only trigger on a real dying battery; <2.5V is USB-only / no battery.
	if (batteryVoltage <= (battMinMv / 1000.0f) && batteryVoltage > 2.5f) {
		Serial.println("Battery empty! Sending 0% and shutting down.");
		send(msgBatt.set(batteryVoltage, 2));
		sendBatteryLevel(0);
		digitalWrite(LED_PIN, LOW);
		Serial.flush();
		sleep(0);
		return;
	}

	// Send to gateway
	Serial.println("Sending to gateway...");
	bool ok1 = send(msgTemp.set(temperature, 1));
	bool ok2 = send(msgHum.set(humidity, 1));
	bool ok3 = send(msgBatt.set(batteryVoltage, 2));
	Serial.print("Send results: T=");
	Serial.print(ok1);
	Serial.print(" H=");
	Serial.print(ok2);
	Serial.print(" B=");
	Serial.print(ok3);

	// Send signal report (ATC) - RX RSSI from ACK, TX power level
	int16_t rssi = transportGetSignalReport(SR_RX_RSSI);
	int16_t txPower = transportGetSignalReport(SR_TX_POWER_LEVEL);
	send(msgRSSI.set(rssi));
	send(msgTxPower.set(txPower));
	Serial.print(" RSSI=");
	Serial.print(rssi);
	Serial.print(" TX=");
	Serial.println(txPower);

	// Also send battery level to controller
	sendBatteryLevel(batteryPercent);

	// Report current parameter values only on first boot to initialize the controller.
	// Never resend on wakeups: that would overwrite any value the user changed via the
	// gateway between sleep cycles. Changes arrive via receive() while the node is awake.
	//
	// sendBatteryLevel() is called BEFORE the 60 s wait so it executes while transport
	// state is clean. The MySensors echo mechanism (auto-reply to gateway SETs received
	// during wait()) sends a transport frame after receive() returns, which leaves the
	// transport in a subtly corrupted state — calling sendBatteryLevel() after wait()
	// would hang the node.
	if (firstLoop) {
		send(msgInterval.set((uint16_t)(sleepTimeMs / 1000)));
		send(msgBattMin.set(battMinMv));
		send(msgBattMax.set(battMaxMv));
		firstLoop = false;
		// On first boot, wait 60 s so the user can push custom parameter SETs
		// from the gateway before the node enters its regular sleep cycle.
#ifndef MY_DISABLED_SERIAL
		Serial.println("First boot: waiting 60s for parameter changes...");
		Serial.flush();
#endif
		// Brief 1 Hz blink pattern (6 toggles × 150 ms = 0.9 s) to signal parameter window.
		// Uses delay() — blocks radio for <1 s, acceptable here.
		for (int i = 0; i < 6; i++) {
			digitalWrite(LED_PIN, i & 1 ? LOW : HIGH);
			delay(150);
		}
		digitalWrite(LED_PIN, HIGH);
		// Use 1 s slices instead of a single wait(60000): a gateway SET+echo during
		// a long wait() can leave the RFM69 driver in a state where _process() never
		// returns, hanging wait() indefinitely. Short slices let each call time out
		// cleanly and reset the polling state before the next slice starts.
		for (uint8_t i = 0; i < 60; i++) {
			wait(1000);
			flushPendingSaves();   // persist any gateway parameter changes
		}
	}

	// Wait for any pending SET messages from the controller before sleeping.
	// The controller may retry a failed delivery once it sees the node is active
	// (from the temperature/battery messages above). Without this window, the
	// node sleeps before the retry arrives and the user's change is lost.
	wait(2000);
	flushPendingSaves();   // persist any gateway parameter changes

	// Enter low power sleep (MCU STOP mode + radio sleep)
	digitalWrite(LED_PIN, LOW);  // LED off before sleep
	Serial.print("Sleeping ");
	Serial.print(sleepTimeMs / 1000);
	Serial.println("s...");
	Serial.flush();

	sleep(sleepTimeMs);

	Serial.println("Woke up");
}
